In [2]:
import sqlite3
import pandas as pd
db=sqlite3.connect('School.sqlite')

In [5]:
data=pd.read_sql_query('select * from students',db)
data

   Rollnumber       name  age
0         101      sahil   21
1         105       manu   27
2         106     vanshu   27
3         107  vanshajmc   30

In [11]:
data1=pd.DataFrame([[1, "aman","English",2000],[202,"anil","Maths",3000]],columns=["ID","name","course","salary"])

In [12]:
data1

    ID  name   course  salary
0    1  aman  English    2000
1  202  anil    Maths    3000

In [19]:
data1.to_sql("Faculty",db, if_exists="replace")

In [15]:
data1['address']='Test'

In [17]:
data1.to_sql('Student',db,if_exists="replace")